In [0]:
import pandas as pd

In [7]:
arquivo = '../content/drive/My Drive/Temp/salarios2.csv'
df = pd.read_csv(arquivo)
df.head()

             Full Name            Position Title  ... Monthly Salary  Daily Salary
0      AARON,  ELVIA J          WATER RATE TAKER  ...        7413.75        243.74
1    AARON,  JEFFERY M            POLICE OFFICER  ...        6731.50        221.31
2       AARON,  KARINA            POLICE OFFICER  ...        6731.50        221.31
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  ...        7065.00        232.27
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV  ...        8728.00        286.95

[5 rows x 6 columns]

---
### **Estat√≠sticas**

In [8]:
df.describe()

       Annual Salary  Monthly Salary  Daily Salary
count   32181.000000    32181.000000  32181.000000
mean    79167.525846     6597.293754    216.896701
std     24462.356640     2038.529689     67.020052
min         0.960000        0.080000      0.000000
25%     69888.000000     5824.000000    191.470000
50%     83616.000000     6968.000000    229.080000
75%     91764.000000     7647.000000    251.410000
max    260004.000000    21667.000000    712.340000

In [9]:
df.describe(percentiles=[.20,.40,.60,.80])

       Annual Salary  Monthly Salary  Daily Salary
count   32181.000000    32181.000000  32181.000000
mean    79167.525846     6597.293754    216.896701
std     24462.356640     2038.529689     67.020052
min         0.960000        0.080000      0.000000
20%     65946.000000     5495.500000    180.670000
40%     80778.000000     6731.500000    221.310000
50%     83616.000000     6968.000000    229.080000
60%     86520.000000     7210.000000    237.040000
80%     93745.600000     7812.130000    256.840000
max    260004.000000    21667.000000    712.340000

In [10]:
df['Full Name'].describe()

count                32181
unique               31893
top       RIVERA,  RICARDO
freq                     4
Name: Full Name, dtype: object

In [11]:
df.mean()

Annual Salary     79167.525846
Monthly Salary     6597.293754
Daily Salary        216.896701
dtype: float64

In [12]:
df['Annual Salary'].quantile(.50) #percentile

83616.0

In [13]:
df[['Monthly Salary','Annual Salary']].median()

Monthly Salary     6968.0
Annual Salary     83616.0
dtype: float64

In [14]:
# .agg monta um .describe customizado
# Inclusive com fun√ß√µes customizadas e importadas de outros m√≥dulos
def cust(column):
    return column.quantile(0.75)

df[['Monthly Salary','Annual Salary']].agg(['min','mean','max',cust])

      Monthly Salary  Annual Salary
min         0.080000       0.960000
mean     6597.293754   79167.525846
max     21667.000000  260004.000000
cust     7647.000000   91764.000000

In [15]:
df['Daily Salary'].cumsum() #soma cumulativa

0            243.74
1            465.05
2            686.36
3            918.63
4           1205.58
            ...
32177    6979184.29
32178    6979413.37
32179    6979650.41
32180    6979952.74
32181           NaN
Name: Daily Salary, Length: 32182, dtype: float64